app/services/form_w2_service.rb

INSERT INTO "user_input_forms" ("total_income", "total_tax_paid", "total_taxable_income", "user_id", "form_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def calculate(obj = {})

    if obj[:total_income] <= 10000
      total_taxable_income = obj[:total_income]
    elsif obj[:total_income] <= 50000
      total_taxable_income = obj[:total_income]  - 1000
    else
      total_taxable_income = obj[:total_income]  * 0.98
    end

    UserInputForm.create(total_income: obj[:total_income], total_tax_paid: obj[:total_tax_paid],
                         total_taxable_income: total_taxable_income, user_id: obj[:user].id, form_id: obj[:form].id)