app/services/form_1099_service.rb

  def calculate(obj = {})
    taxable_income = obj[:total_income] - obj[:total_business_expense]
    taxable_income = taxable_income - (2.1 * obj[:total_miles_driven])

    if taxable_income <= 10000
      total_taxable_income = taxable_income
    elsif taxable_income <= 50000
      total_taxable_income = taxable_income - 1000
    else
      total_taxable_income = taxable_income * 0.99
    end

    UserInputForm.create(total_income: obj[:total_income], total_business_expenses: obj[:total_business_expense],
                         total_miles_driven: obj[:total_miles_driven], total_taxable_income: total_taxable_income,
                         user_id: obj[:user].id, form_id: obj[:form].id)
---
INSERT INTO "user_input_forms" ("total_income", "total_business_expenses", "total_miles_driven", "total_taxable_income", "user_id", "form_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"