app/controllers/api/v1/forms_controller.rb

SELECT "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def submit_form
    form = Form.find(params[:form_id])