app/controllers/api/v1/forms_controller.rb

SELECT "forms".* FROM "forms" WHERE "forms"."is_system_generated" = $1  [["is_system_generated", false]]
---
  def index
    render json: {msg: 'Successfully Executed', data: Form.where(is_system_generated: false)}, status: :ok

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def fetch_user
    raise ApplicationError.validation_failed('User Id not present') if params[:user_id].nil?
    @user = User.find(params[:user_id])

SELECT "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def fetch_form
    raise ApplicationError.validation_failed('Form Id not present') if params[:form_id].nil?
    @form = Form.find(params[:form_id])