app/controllers/api/v1/users_controller.rb

  def index
    render json: {msg: 'Successfully Executed', data: User.all}, status: :ok
---
SELECT "users".* FROM "users"